nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_qsci.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.qsci"
#endif

/* QSCI transfer state. */
enum
{
    kQSCI_TxIdle,         /*!< TX idle. */
    kQSCI_TxBusy,         /*!< TX busy. */
    kQSCI_RxIdle,         /*!< RX idle. */
    kQSCI_RxBusy,         /*!< RX busy. */
    kQSCI_RxFramingError, /*!< Rx framing error */
    kQSCI_RxParityError   /*!< Rx parity error */
};

/* Typedef for interrupt handler. */
typedef void (*qsci_isr_t)(qsci_transfer_handle_t *psHandle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Writes to TX register using non-blocking method.
 *
 * This function writes data to the TX register directly, upper layer must make
 * sure the TX register is empty or TX FIFO has room before calling this function.
 *
 * @note This function does not check whether all the data has been sent out to bus,
 * so before disabling TX, check kQSCI_TxIdleFlag to ensure the TX is finished.
 *
 * @param base QSCI peripheral base address.
 * @param pu8Data Start address of the data to write.
 * @param u32Length Size of the buffer to be sent.
 */
static void QSCI_WriteNonBlocking(QSCI_Type *base, const uint8_t *pu8Data, uint32_t u32Length);

/*!
 * @brief Reads RX register using non-blocking method.
 *
 * This function reads data from the RX register directly, upper layer must make
 * sure the RX register is full or RX FIFO has data before calling this function.
 *
 * @param base QSCI peripheral base address.
 * @param ou8Data Start address of the buffer to store the received data.
 * @param u32Length Size of the buffer.
 */
static void QSCI_ReadNonBlocking(QSCI_Type *base, uint8_t *pu8Data, uint32_t u32Length);

/*!
 * @brief Calculates baud rate divider.
 *
 * @param u32BaudRateBps QSCI baud rate.
 * @param u32SrcClk QSCI clock frequency.
 * @return baud rate divider.
 */
static uint32_t QSCI_CalculateBaudrateConfig(uint32_t u32BaudRateBps, uint32_t u32SrcClk);

/*!
 * @brief Sets baud rate divider configuration.
 *
 * @param base QSCI peripheral base address.
 * @param u32Divider baud rate divider.
 */
static void QSCI_ConfigBaudRate(QSCI_Type *base, uint32_t u32Divider);

/*!
 * @brief Checks if the ring buffer is full.
 *
 * @param psHandle QSCI handle pointer.
 * @return True is full, false is not full.
 */
static bool QSCI_TransferIsRxRingBufferFull(qsci_transfer_handle_t *psHandle);

/*!
 * brief QSCI IRQ handle function.
 *
 * This function handles the QSCI transmit and receive IRQ request.
 *
 * param base QSCI peripheral base address.
 * param psHandle QSCI handle pointer.
 */
void QSCI_TransferHandleIRQ(qsci_transfer_handle_t *psHandle);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/* Array of QSCI peripheral base address. */
static const QSCI_Type *s_pfQsciBases[] = QSCI_BASE_PTRS;

/*! @brief Pointers to qsci IRQ number for each instance. */
static IRQn_Type const s_eQsciRXIRQs[]     = QSCI_RX_IRQS;
static IRQn_Type const s_eQsciRXErrIRQs[]  = QSCI_RX_ERR_IRQS;
static IRQn_Type const s_eQsciTXIRQs[]     = QSCI_TX_IRQS;
static IRQn_Type const s_eQsciTXIdleIRQs[] = QSCI_TRIDLE_IRQS;

/* Array of QSCI handle. */
static qsci_transfer_handle_t *s_psQsciHandles[ARRAY_SIZE(s_pfQsciBases)];
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Array of QSCI clock name. */
static const clock_ip_name_t s_eQsciClocks[] = QSCI_CLOCKS;
#endif
/* QSCI ISR for transactional APIs. */
static qsci_isr_t s_pfQsciIsr;

/*******************************************************************************
 * Code
 ******************************************************************************/
/* ============================================= Functional Group APIs ============================================== */
/*!
 * brief Sets the QSCI configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure to default value for @ref QSCI_Init to use.
 * Use the unchanged structure in @ref QSCI_Init or modify the structure before calling @ref QSCI_Init.
 * This is an example:
 * code
 *   qsci_config_t sConfig;
 *   QSCI_GetDefaultConfig(&sConfig, 115200, 12000000U);
 *   QSCI_Init(QSCI0, &config);
 * endcode
 *
 * param psConfig Pointer to configuration structure.
 * param u32BaudRateBps Baudrate setting.
 * param u32SrcClockHz The clock source frequency for QSCI module.
 */
void QSCI_GetDefaultConfig(qsci_config_t *psConfig, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz)
{
    assert(NULL != psConfig);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    psConfig->eTransferMode     = kQSCI_Normal;
    psConfig->bStopInWaitEnable = false;
    psConfig->eDataBitMode      = kQSCI_Data8Bit;
    psConfig->eWakeupMode       = kQSCI_WakeupOnIdleLine;
    psConfig->ePolarityMode     = kQSCI_PolarityNormal;
    psConfig->eParityMode       = kQSCI_ParityDisabled;
    psConfig->bEnableStopHold   = false;
    psConfig->bEnableTx         = false;
    psConfig->bEnableRx         = false;

    psConfig->bEnableFifo  = true;
    psConfig->bEnableTxDMA = false;
    psConfig->bEnableRxDMA = false;

    psConfig->eTxFifoWatermark = kQSCI_TxWater3Word;
    psConfig->eRxFifoWatermark = kQSCI_RxWater1Word;
    psConfig->u32BaudRateBps   = u32BaudRateBps;
    psConfig->u32SrcClockHz    = u32SrcClockHz;
    psConfig->u8Interrupts     = 0U;
}

/*!
 * brief Initializes the QSCI instance with a user configuration structure.
 *
 * This function configures the QSCI module with the customed settings. User can configure the configuration structure
 * manually or get the default configuration by using the @ref QSCI_GetDefaultConfig function.
 * The example below shows how to use this API to configure QSCI.
 * code
 *   qsci_config_t sConfig;
 *   QSCI_GetDefaultConfig(&sConfig, 115200, 12000000U);
 *   QSCI_Init(QSCI0, &config);
 * endcode
 *
 * param base QSCI peripheral base address.
 * param psConfig Pointer to the user-defined configuration structure.
 * retval kStatus_QSCI_BaudrateNotSupport Baudrate is not supported in the current clock source.
 * retval kStatus_Success Set baudrate succeeded.
 */
status_t QSCI_Init(QSCI_Type *base, qsci_config_t *psConfig)
{
    assert(NULL != psConfig);
    assert(0U != psConfig->u32BaudRateBps);
    assert(0U != psConfig->u32SrcClockHz);

