nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
    status_t status = kStatus_Success;
    uint16_t ctrl1 = 0U, ctrl2 = 0U;

    QSCI_Reset(base);

    uint32_t div = QSCI_CalculateBaudrateConfig(psConfig->u32BaudRateBps, psConfig->u32SrcClockHz);

    if (div != 0U)
    {
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
        /* Only enable qsci clock if baudrate is within accuracy. */
        CLOCK_EnableClock(s_eQsciClocks[QSCI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
        QSCI_ConfigBaudRate(base, div);
    }
    else
    {
        /* Unacceptable baud rate difference of more than 3% */
        return kStatus_QSCI_BaudrateNotSupport;
    }

    QSCI_SetTransferMode(base, psConfig->eTransferMode);
    QSCI_EnableStopInWait(base, psConfig->bStopInWaitEnable);
    QSCI_Enable9bitMode(base, (psConfig->eDataBitMode == kQSCI_Data9Bit));
    QSCI_SetWakeupMode(base, psConfig->eWakeupMode);
    QSCI_SetPolarityMode(base, psConfig->ePolarityMode);
    QSCI_SetParityMode(base, psConfig->eParityMode);
    QSCI_SetTxWaterMark(base, psConfig->eTxFifoWatermark);
    QSCI_SetRxWaterMark(base, psConfig->eRxFifoWatermark);
    QSCI_EnableFifo(base, psConfig->bEnableFifo);
    QSCI_EnableTxDMA(base, psConfig->bEnableTxDMA);
    QSCI_EnableRxDMA(base, psConfig->bEnableRxDMA);
    QSCI_EnableStopHold(base, psConfig->bEnableStopHold);
    QSCI_EnableInterrupts(base, psConfig->u8Interrupts);

    if (psConfig->bEnableTx)
    {
        QSCI_EnableTx(base, true);
    }
    if (psConfig->bEnableRx)
    {
        QSCI_EnableRx(base, true);
    }

    return kStatus_Success;
}

/*!
 * brief Deinitializes a QSCI instance.
 *
 * This function waits for transmiting complete, then disables TX and RX.
 *
 * param base QSCI peripheral base address.
 */
void QSCI_Deinit(QSCI_Type *base)
{
    if (0U != (base->CTRL1 & QSCI_CTRL1_TE_MASK))
    {
        if (0U != (base->CTRL2 & QSCI_CTRL2_FIFO_EN_MASK))
        {
#if QSCI_RETRY_TIMES
            uint32_t u32WaitTimes = QSCI_RETRY_TIMES;
            while ((0U != (base->CTRL2 & QSCI_CTRL2_TFCNT_MASK)) && (0U != --u32WaitTimes))
            {
            }
            if (0U == u32WaitTimes)
            {
                return kStatus_QSCI_Timeout;
            }
#else
            /* wait data in FIFO shift out */
            while (0U != (base->CTRL2 & QSCI_CTRL2_TFCNT_MASK))
            {
            }
#endif
        }
#if QSCI_RETRY_TIMES
        u32WaitTimes = QSCI_RETRY_TIMES;
        while ((0U == (base->STAT & QSCI_STAT_TIDLE_MASK)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_QSCI_Timeout;
        }
#else
        /* wait last byte to shift out at TxD */
        while (0U == (base->STAT & QSCI_STAT_TIDLE_MASK))
        {
        }
#endif
    }

    /* Disable the module. */
    QSCI_Reset(base);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_DisableClock(s_eQsciClocks[QSCI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Clears QSCI status flags.
 *
 * This function clears QSCI status flags. Members in kQSCI_Group0Flags can't be cleared by this function, they are
 * cleared or set by hardware.
 *
 * param base QSCI peripheral base address.
 * param u16StatusFlags The status flag mask, can be a single flag or several flags in #_qsci_status_flags combined by
 * OR.
 */
void QSCI_ClearStatusFlags(QSCI_Type *base, uint16_t u16StatusFlags)
{
    /*
     * 1. kQSCI_Group0Flags can't be cleared by this function, they are handled by HW
     * 2. All kQSCI_Group1Flags will be cleared if any kQSCI_Group1Flags or kQSCI_Group2Flags in the mask
     * 3. kQSCI_Group2Flags can be cleared individually
     */
    uint16_t group12 = kQSCI_Group1Flags | kQSCI_Group2Flags;
    if (0U != (u16StatusFlags & group12))
    {
        uint16_t reg = base->STAT;
        reg &= ~((uint16_t)kQSCI_Group2Flags);
        reg |= (u16StatusFlags & ((uint16_t)kQSCI_Group2Flags));
        base->STAT = reg;
        if (0U != (u16StatusFlags & kQSCI_RxIdleLineFlag))
        {
            (void)base->DATA;
        }
    }
}

/*!
 * brief Enables QSCI interrupts according to the provided mask.
 *
 * This function enables the QSCI interrupts according to the provided mask. The mask is a logical OR of enumeration
 * members in #_qsci_interrupt_enable.
 *
 * param base QSCI peripheral base address.
 * param u8Interrupts The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable
 * combined by OR.
 */
void QSCI_EnableInterrupts(QSCI_Type *base, uint8_t u8Interrupts)
{
    u8Interrupts &= (uint8_t)kQSCI_AllInterruptEnable;

    /* The interrupt mask is combined by control bits from
     * several register: (CTRL1 | (CTRL2 >> 2U)) */

    base->CTRL1 |= (uint8_t)(u8Interrupts & 0xF0U);
    base->CTRL2 |= (uint8_t)((u8Interrupts & 0xFU) << 2U);
}

/*!
 * brief Disables QSCI interrupts according to the provided mask.
 *
 * This function disables the QSCI interrupts according to the provided mask. The mask is a logical OR of enumeration
 * members in #_qsci_interrupt_enable.
 *
 * param base QSCI peripheral base address.
 * param u8Interrupts The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable
 * combined by OR.
 */
void QSCI_DisableInterrupts(QSCI_Type *base, uint8_t u8Interrupts)
{
    u8Interrupts &= (uint8_t)kQSCI_AllInterruptEnable;

    /* The interrupt mask is combined by control bits from
     * several register: (CTRL1 | (CTRL2 >> 2U)) */

    base->CTRL1 &= ~(uint8_t)(u8Interrupts & 0xF0U);
    base->CTRL2 &= ~(uint8_t)((u8Interrupts & 0xFU) << 2U);
}

/*!
 * brief Gets the enabled QSCI interrupts.
 *
 * This function gets the enabled QSCI interrupts. The enabled interrupts are returned as the logical OR value of the
 * enumerators #_qsci_interrupt_enable.
 *
 * param base QSCI peripheral base address.
 * return The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable combined
 * by OR.
 */
uint8_t QSCI_GetEnabledInterrupts(QSCI_Type *base)
{
    uint8_t u8Interrupts;

    u8Interrupts = (uint8_t)base->CTRL1;
    u8Interrupts |= ((uint8_t)(base->CTRL2)) >> 16U;

    return u8Interrupts & ((uint8_t)kQSCI_AllInterruptEnable);
}

/*!
 * brief Sets the QSCI instance baud rate.
 *
 * This function configures the QSCI module baud rate. This function can be used to update QSCI module baud rate after
 * the QSCI module is initialized by the @ref QSCI_Init.
 *
 * param base QSCI peripheral base address.
 * param u32BaudRateBps QSCI baudrate to be set.
 * param uint32_t u32SrcClockHz QSCI clock source frequency in Hz.
 * retval kStatus_QSCI_BaudrateNotSupport Baudrate is not supported in the current clock source.
 * retval kStatus_Success Set baudrate succeeded.
 */
status_t QSCI_SetBaudRate(QSCI_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz)
{
    status_t status = kStatus_Success;

    uint32_t div = QSCI_CalculateBaudrateConfig(u32BaudRateBps, u32SrcClockHz);

    if (div != 0U)
    {
        QSCI_ConfigBaudRate(base, div);
    }
    else
    {
        /* Unacceptable baud rate difference of more than 3% */
        status = kStatus_QSCI_BaudrateNotSupport;
    }

