nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
    return status;
}

/*!
 * brief Writes TX register using a blocking method.
 *
 * This function polls the TX register, waits TX register to be empty or TX FIFO
 * have room then writes data to the TX buffer.
 *
 * param base QSCI peripheral base address.
 * param pu8Data Start address of the data to write.
 * param u32Length Size of the data to write.
 */
void QSCI_WriteBlocking(QSCI_Type *base, const uint8_t *pu8Data, uint32_t u32Length)
{
    while (0U != u32Length--)
    {
#if QSCI_RETRY_TIMES
        uint32_t u32WaitTimes = QSCI_RETRY_TIMES;
        while ((0U == (base->STAT & QSCI_STAT_TDRE_MASK)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_QSCI_Timeout;
        }
#else
        while (0U == (base->STAT & QSCI_STAT_TDRE_MASK))
        {
        }
#endif
        base->DATA = *pu8Data++;
    }
#if QSCI_RETRY_TIMES
    u32WaitTimes = QSCI_RETRY_TIMES;
    while ((0U == (base->STAT & QSCI_STAT_TIDLE_MASK)) && (0U != --u32WaitTimes))
    {
    }
    if (0U == u32WaitTimes)
    {
        return kStatus_QSCI_Timeout;
    }
#else
    /* Ensure all the data in the transmit buffer are sent out to bus. */
    while (0U == (base->STAT & QSCI_STAT_TIDLE_MASK))
    {
    }
#endif
}

/*!
 * brief Reads RX data register using a blocking method.
 *
 * This function polls the RX register, waits RX register to be full or RX FIFO
 * have pu8Data, then reads data from the RX register.
 *
 * param base QSCI peripheral base address.
 * param pu8Data Start address of the buffer to store the received data.
 * param u32Length Size of the buffer.
 * retval kStatus_Fail Receiver error occurred while receiving data.
 * retval kStatus_QSCI_RxHardwareOverrun Receiver overrun occurred while receiving data
 * retval kStatus_QSCI_NoiseError Noise error occurred while receiving data
 * retval kStatus_QSCI_FramingErrorFraming error occurred while receiving data
 * retval kStatus_QSCI_ParityError Parity error occurred while receiving data
 * retval kStatus_Success Successfully received all data.
 */
status_t QSCI_ReadBlocking(QSCI_Type *base, uint8_t *pu8Data, uint32_t u32Length)
{
    assert(pu8Data != NULL);

    status_t status = kStatus_Success;
    uint16_t statusFlag;

    while ((u32Length--) != 0U)
    {
        while (((base->STAT & QSCI_STAT_RDRF_MASK) == 0U) && ((base->CTRL2 & QSCI_CTRL2_RFCNT_MASK) == 0U))
        {
            statusFlag = QSCI_GetStatusFlags(base);

            if (0U != (statusFlag & (uint16_t)kQSCI_Group1Flags))
            {
                QSCI_ClearStatusFlags(base, statusFlag);
                if (0U != (statusFlag & (uint16_t)kQSCI_RxOverrunFlag))
                {
                    status = kStatus_QSCI_RxHardwareOverrun;
                    /* Other error flags(FE, NF, and PF) are prevented from setting once OR is set, no need to check
                     * other error flags*/
                    break;
                }

                if (0U != (statusFlag & (uint16_t)kQSCI_RxParityErrorFlag))
                {
                    status = kStatus_QSCI_ParityError;
                }

                if (0U != (statusFlag & (uint16_t)kQSCI_RxFrameErrorFlag))
                {
                    status = kStatus_QSCI_FramingError;
                }

                if (0U != (statusFlag & (uint16_t)kQSCI_RxNoiseFlag))
                {
                    status = kStatus_QSCI_NoiseError;
                }

                break;
            }
        }
        if (kStatus_Success == status)
        {
            *pu8Data++ = base->DATA;
        }
        else
        {
            break;
        }
    }

    return status;
}

/* ============================================ Transactional Group APIs ============================================ */
/*!
 * brief Initializes the QSCI handle.
 *
 * This function initializes the QSCI handle which can be used for other QSCI
 * transactional APIs. Usually, for a specified QSCI instance,
 * call this API once to get the initialized handle.
 *
 * param base QSCI peripheral base address.
 * param psHandle QSCI handle pointer.
 * param pfCallback The callback function.
 * param pUserData The parameter of the callback function.
 */
void QSCI_TransferCreateHandle(QSCI_Type *base,
                               qsci_transfer_handle_t *psHandle,
                               qsci_transfer_callback_t pfCallback,
                               void *pUserData)
{
    assert(NULL != psHandle);

    uint16_t instance;

    /* Zero the handle. */
    (void)memset((void *)psHandle, 0, sizeof(*psHandle));

    /* Set the TX/RX state. */
    psHandle->u8RxState = (uint8_t)kQSCI_RxIdle;
    psHandle->u8TxState = (uint8_t)kQSCI_TxIdle;

    /* Set the callback and user data and base pointer. */
    psHandle->pfCallback = pfCallback;
    psHandle->pUserData  = pUserData;
    psHandle->base       = base;

    /* Get instance from peripheral base address. */
    instance = QSCI_GetInstance(base);

    s_pfQsciIsr = QSCI_TransferHandleIRQ;

    /* Save the handle in global variables to support the double weak mechanism. */
    s_psQsciHandles[instance] = psHandle;

    /* Enable global IRQs. */
    (void)EnableIRQ(s_eQsciRXIRQs[instance]);
    (void)EnableIRQ(s_eQsciRXErrIRQs[instance]);
    (void)EnableIRQ(s_eQsciTXIRQs[instance]);
    (void)EnableIRQ(s_eQsciTXIdleIRQs[instance]);
}

/*!
 * brief Sets up the RX ring buffer.
 *
 * This function sets up the RX ring buffer to a specific QSCI handle.
 *
 * When the RX ring buffer is used, data received are stored into the ring buffer even when the
 * user doesn't call the QSCI_TransferReceiveNonBlocking() API. If data is already received
 * in the ring buffer, the user can get the received data from the ring buffer directly.
 *
 * note When using the RX ring buffer, one byte is reserved for internal use. In other
 * words, if u16RxRingBufferSize is 32, only 31 bytes are used for saving data.
 *
 * param psHandle QSCI handle pointer.
 * param pu8RxRingBuffer Start address of the ring buffer for background receiving. Pass NULL to disable the ring
 * buffer. param u16RxRingBufferSize Size of the ring buffer.
 */
void QSCI_TransferStartRingBuffer(qsci_transfer_handle_t *psHandle,
                                  uint8_t *pu8RxRingBuffer,
                                  uint16_t u16RxRingBufferSize)
{
    assert(NULL != psHandle);
    assert(NULL != pu8RxRingBuffer);

    /* Setup the ringbuffer address */
    psHandle->pu8RxRingBuffer     = pu8RxRingBuffer;
    psHandle->u16RxRingBufferSize = u16RxRingBufferSize;
    psHandle->u16RxRingBufferHead = 0U;
    psHandle->u16RxRingBufferTail = 0U;

    /* Enable rx. */
    QSCI_EnableRx(psHandle->base, true);

    /* Enable the interrupt to accept the data when user need the ring buffer. */
    QSCI_EnableInterrupts(psHandle->base, (uint8_t)kQSCI_RxFullInterruptEnable | (uint8_t)kQSCI_RxErrorInterruptEnable);
}

/*!
 * brief Aborts the background transfer and uninstalls the ring buffer.
 *
 * This function aborts the background transfer and uninstalls the ring buffer.
 *
 * param psHandle QSCI handle pointer.
 */
void QSCI_TransferStopRingBuffer(qsci_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    if (psHandle->u8RxState == (uint8_t)kQSCI_RxIdle)
    {
        QSCI_DisableInterrupts(psHandle->base,
                               (uint8_t)kQSCI_RxFullInterruptEnable | (uint8_t)kQSCI_RxErrorInterruptEnable);
    }

    psHandle->pu8RxRingBuffer     = NULL;
    psHandle->u16RxRingBufferSize = 0U;
    psHandle->u16RxRingBufferHead = 0U;
    psHandle->u16RxRingBufferTail = 0U;
}

/*!
 * brief Get the ring buffer valid data length.
 *
 * param psHandle QSCI handle pointer.
 * return Valid data length in ring buffer.
 */
uint16_t QSCI_TransferGetRxRingBufferLength(qsci_transfer_handle_t *psHandle)
{
    uint16_t u16Size;
    uint16_t u16RxRingBufferHead, u16RxRingBufferTail;

