nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
    assert(NULL != psHandle);

    u16RxRingBufferHead = psHandle->u16RxRingBufferHead;
    u16RxRingBufferTail = psHandle->u16RxRingBufferTail;

    if (u16RxRingBufferTail > u16RxRingBufferHead)
    {
        u16Size = (uint16_t)u16RxRingBufferHead + psHandle->u16RxRingBufferSize - (uint16_t)u16RxRingBufferTail;
    }
    else
    {
        u16Size = (uint16_t)u16RxRingBufferHead - (uint16_t)u16RxRingBufferTail;
    }

    return u16Size;
}

/*!
 * brief Transmits a buffer of data using the interrupt method.
 *
 * This function sends data using an interrupt method. This is a non-blocking function, which
 * returns directly without waiting for all data to be written to the TX register. When
 * all data is sent out, the QSCI driver calls the callback function and passes the
 * kStatus_QSCI_TxIdle as status parameter.
 *
 * param psHandle QSCI handle pointer.
 * param psTransfer QSCI transfer structure. See #qsci_transfer_t.
 * retval kStatus_Success Successfully start the data transmission.
 * retval kStatus_QSCI_TxBusy Previous transmission still not finished; data not all written to TX register yet.
 */
status_t QSCI_TransferSendNonBlocking(qsci_transfer_handle_t *psHandle, qsci_transfer_t *psTransfer)
{
    assert(NULL != psHandle);
    assert(NULL != psTransfer);
    assert(0U != psTransfer->u32DataSize);
    assert(NULL != psTransfer->pu8Data);

    status_t status;

    /* Return error if current TX busy. */
    if ((uint8_t)kQSCI_TxBusy == psHandle->u8TxState)
    {
        status = kStatus_QSCI_TxBusy;
    }
    else
    {
        psHandle->pu8TxData          = psTransfer->pu8Data;
        psHandle->u32TxRemainingSize = psTransfer->u32DataSize;
        psHandle->u32TxDataSize      = psTransfer->u32DataSize;
        psHandle->u8TxState          = (uint8_t)kQSCI_TxBusy;

        /* Enable tx. */
        QSCI_EnableTx(psHandle->base, true);

        /* Enable transmitter interrupt. */
        QSCI_EnableInterrupts(psHandle->base, (uint8_t)kQSCI_TxEmptyInterruptEnable);

        status = kStatus_Success;
    }

    return status;
}

/*!
 * brief Aborts the interrupt-driven data transmit.
 *
 * This function aborts the interrupt-driven data sending. The user can get the remainBytes to find out
 * how many bytes are not sent out.
 *
 * param psHandle QSCI handle pointer.
 */
void QSCI_TransferAbortSend(qsci_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSCI_DisableInterrupts(psHandle->base,
                           (uint8_t)kQSCI_TxEmptyInterruptEnable | (uint8_t)kQSCI_TxIdleInterruptEnable);

    psHandle->u32TxRemainingSize = 0U;
    psHandle->u8TxState          = (uint8_t)kQSCI_TxIdle;

    /* Disable tx. */
    QSCI_EnableTx(psHandle->base, false);
}

/*!
 * brief Gets the number of bytes sent out to bus.
 *
 * This function gets the number of bytes sent out to bus by using the interrupt method.
 *
 * param psHandle QSCI handle pointer.
 * param pu32Count Send bytes count.
 * retval kStatus_NoTransferInProgress No send in progress.
 * retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t QSCI_TransferGetSendCount(qsci_transfer_handle_t *psHandle, uint32_t *pu32Count)
{
    assert(NULL != psHandle);
    assert(NULL != pu32Count);

    if ((uint8_t)kQSCI_TxIdle == psHandle->u8TxState)
    {
        return kStatus_NoTransferInProgress;
    }

    *pu32Count = psHandle->u32TxDataSize - psHandle->u32TxRemainingSize;

    return kStatus_Success;
}

/*!
 * brief Receives a buffer of data using an interrupt method.
 *
 * This function receives data using an interrupt method. This is a non-blocking function, which
 *  returns without waiting for all data to be received.
 * If the RX ring buffer is used and not empty, the data in the ring buffer is copied and
 * the parameter pu32ReceivedBytes shows how many bytes are copied from the ring buffer.
 * After copying, if the data in the ring buffer is not enough to read, the receive
 * request is saved by the QSCI driver. When the new data arrives, the receive request
 * is serviced first. When all data is received, the QSCI driver notifies the upper layer
 * through a callback function and passes the status parameter kStatus_QSCI_RxIdle.
 * For example, the upper layer needs 10 bytes but there are only 5 bytes in the ring buffer.
 * The 5 bytes are copied to the psTransfer->pu8Data and this function returns with the
 * parameter pu32ReceivedBytes set to 5. For the left 5 bytes, newly arrived data is
 * saved from the psTransfer->pu8Data[5]. When 5 bytes are received, the QSCI driver notifies the upper layer.
 * If the RX ring buffer is not enabled, this function enables the RX and RX interrupt
 * to receive data to the psTransfer->pu8Data. When all data is received, the upper layer is notified.
 *
 * param psHandle QSCI handle pointer.
 * param psTransfer QSCI transfer structure, see #qsci_transfer_t.
 * param pu32ReceivedBytes Bytes received from the ring buffer directly.
 * retval kStatus_Success Successfully queue the transfer into transmit queue.
 * retval #kStatus_QSCI_RxBusy Previous receive request is not finished.
 */
status_t QSCI_TransferReceiveNonBlocking(qsci_transfer_handle_t *psHandle,
                                         qsci_transfer_t *psTransfer,
                                         uint32_t *pu32ReceivedBytes)
{
    assert(NULL != psHandle);
    assert(NULL != psTransfer);
    assert(NULL != psTransfer->pu8Data);
    assert(0U != psTransfer->u32DataSize);

    uint32_t i;
    status_t status;
    /* How many bytes to copy from ring buffer to user memory. */
    uint32_t u32BytesToCopy = 0U;
    /* How many bytes to receive. */
    uint32_t u32BytesToReceive;
    /* How many bytes currently have received. */
    uint32_t u32BytesCurrentReceived;
    /* Enable rx. */
    QSCI_EnableRx(psHandle->base, true);

    /* How to get data:
       1. If RX ring buffer is not enabled, then save psTransfer->pu8Data and psTransfer->u32DataSize
          to qsci handle, enable interrupt to store received data to psTransfer->pu8Data. When
          all data received, trigger callback.
       2. If RX ring buffer is enabled and not empty, get data from ring buffer first.
          If there are enough data in ring buffer, copy them to psTransfer->pu8Data and return.
          If there are not enough data in ring buffer, copy all of them to psTransfer->pu8Data,
          save the psTransfer->pu8Data remained empty space to qsci handle, receive data
          to this empty space and trigger callback when finished. */

