nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
    if ((uint8_t)kQSCI_RxBusy == psHandle->u8RxState)
    {
        status = kStatus_QSCI_RxBusy;
    }
    else
    {
        u32BytesToReceive       = psTransfer->u32DataSize;
        u32BytesCurrentReceived = 0U;

        /* If RX ring buffer is used. */
        if (psHandle->pu8RxRingBuffer != NULL)
        {
            /* Disable QSCI RX IRQ, protect ring buffer. */
            QSCI_DisableInterrupts(psHandle->base, (uint8_t)kQSCI_RxFullInterruptEnable);

            /* How many bytes in RX ring buffer currently. */
            u32BytesToCopy = QSCI_TransferGetRxRingBufferLength(psHandle);

            if (u32BytesToCopy != 0U)
            {
                u32BytesToCopy = MIN(u32BytesToReceive, u32BytesToCopy);

                u32BytesToReceive -= u32BytesToCopy;

                /* Copy data from ring buffer to user memory. */
                for (i = 0U; i < u32BytesToCopy; i++)
                {
                    psTransfer->pu8Data[u32BytesCurrentReceived++] =
                        psHandle->pu8RxRingBuffer[psHandle->u16RxRingBufferTail];

                    /* Wrap to 0. Not use modulo (%) because it might be large and slow. */
                    if ((uint32_t)(psHandle->u16RxRingBufferTail + 1U) == psHandle->u16RxRingBufferSize)
                    {
                        psHandle->u16RxRingBufferTail = 0U;
                    }
                    else
                    {
                        psHandle->u16RxRingBufferTail++;
                    }
                }
            }

            /* If ring buffer does not have enough data, still need to read more data. */
            if (u32BytesToReceive != 0U)
            {
                /* No data in ring buffer, save the request to QSCI handle. */
                psHandle->pu8RxData          = psTransfer->pu8Data + u32BytesCurrentReceived;
                psHandle->u32RxRemainingSize = u32BytesToReceive;
                psHandle->u32RxDataSize      = u32BytesToReceive;
                psHandle->u8RxState          = (uint8_t)kQSCI_RxBusy;
            }

            /* Enable QSCI RX IRQ if previously enabled. */
            QSCI_EnableInterrupts(psHandle->base, (uint32_t)kQSCI_RxFullInterruptEnable);

            /* Call user callback since all data are received. */
            if (0U == u32BytesToReceive)
            {
                psHandle->busStatus = kStatus_QSCI_RxIdle;
                if (psHandle->pfCallback != NULL)
                {
                    psHandle->pfCallback(psHandle);
                }
            }
        }
        /* Ring buffer not used. */
        else
        {
            psHandle->pu8RxData          = psTransfer->pu8Data + u32BytesCurrentReceived;
            psHandle->u32RxRemainingSize = u32BytesToReceive;
            psHandle->u32RxDataSize      = u32BytesToReceive;
            psHandle->u8RxState          = (uint8_t)kQSCI_RxBusy;

            /* Enable RX/Rx overrun/framing error/idle line interrupt. */
            QSCI_EnableInterrupts(psHandle->base,
                                  (uint8_t)kQSCI_RxFullInterruptEnable | (uint8_t)kQSCI_RxErrorInterruptEnable);
        }

        /* Return how many bytes have read. */
        if (pu32ReceivedBytes != NULL)
        {
            *pu32ReceivedBytes = u32BytesCurrentReceived;
        }

        status = kStatus_Success;
    }

    return status;
}

/*!
 * brief Aborts the interrupt-driven data receiving.
 *
 * This function aborts the interrupt-driven data receiving. The user can get the remainBytes to know
 * how many bytes are not received yet.
 *
 * param psHandle QSCI handle pointer.
 */
void QSCI_TransferAbortReceive(qsci_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    /* Only abort the receive to psHandle->pu8RxData, the RX ring buffer is still working. */
    if (NULL == psHandle->pu8RxRingBuffer)
    {
        /* Disable RX interrupt. */
        QSCI_DisableInterrupts(psHandle->base,
                               (uint8_t)kQSCI_RxFullInterruptEnable | (uint8_t)kQSCI_RxErrorInterruptEnable);
    }

    psHandle->u32RxRemainingSize = 0U;
    psHandle->u8RxState          = (uint8_t)kQSCI_RxIdle;

    /* Disable rx. */
    QSCI_EnableRx(psHandle->base, false);
}

/*!
 * brief Gets the number of bytes that have been received.
 *
 * This function gets the number of bytes that have been received.
 *
 * param handle QSCI handle pointer.
 * param pu32Count Receive bytes count.
 * retval kStatus_NoTransferInProgress No receive in progress.
 * retval kStatus_InvalidArgument Parameter is invalid.
 * retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t QSCI_TransferGetReceiveCount(qsci_transfer_handle_t *psHandle, uint32_t *pu32Count)
{
    assert(NULL != psHandle);
    assert(NULL != pu32Count);

    if ((uint8_t)kQSCI_RxIdle == psHandle->u8RxState)
    {
        return kStatus_NoTransferInProgress;
    }

    if (NULL == pu32Count)
    {
        return kStatus_InvalidArgument;
    }

    *pu32Count = psHandle->u32RxDataSize - psHandle->u32RxRemainingSize;

    return kStatus_Success;
}

/* =============================================== Internal Functions =============================================== */

static uint32_t QSCI_CalculateBaudrateConfig(uint32_t u32BaudRateBps, uint32_t u32SrcClockHz)
{
    assert(0U != u32BaudRateBps);
    uint32_t u32Div;
    uint32_t u32BaudDiff;
    /* Calculate baudrate divider, the formula is u32BaudRateBps * 2U = src/(SBR << 3U + frac)
       divider = (SBR << 3U + frac) */
    u32Div = u32SrcClockHz / (u32BaudRateBps * 2U);
    /* Calculate baudrate error */
    u32BaudDiff = u32SrcClockHz / (u32Div * 2U) - u32BaudRateBps;
    /* Check to see if actual baud rate is within 3% of desired baud rate
     * based on the best calculate divider value */
    if (u32BaudDiff < (uint32_t)((u32BaudRateBps / 100U) * 3U))
    {
        return u32Div;
    }
    else
    {
        /* Unacceptable baud rate difference of more than 3% */
        return 0U;
    }
}

static void QSCI_ConfigBaudRate(QSCI_Type *base, uint32_t u32Divider)
{
    uint16_t ctrl1 = base->CTRL1;
    /* If tx is enabled, wait until transmitter is idle. */
    if (0U != (base->CTRL1 & QSCI_CTRL1_TE_MASK))
    {
        if (0U != (base->CTRL2 & QSCI_CTRL2_FIFO_EN_MASK))
        {
#if QSCI_RETRY_TIMES
            uint32_t u32WaitTimes = QSCI_RETRY_TIMES;
            while ((0U != (base->CTRL2 & QSCI_CTRL2_TFCNT_MASK)) && (0U != --u32WaitTimes))
            {
            }
            if (0U == u32WaitTimes)
            {
                return kStatus_QSCI_Timeout;
            }
#else
            /* wait data in FIFO shift out */
            while (0U != (base->CTRL2 & QSCI_CTRL2_TFCNT_MASK))
            {
            }
#endif
        }
#if QSCI_RETRY_TIMES
        u32WaitTimes = QSCI_RETRY_TIMES;
        while ((0U == (base->STAT & QSCI_STAT_TIDLE_MASK)) && (0U != --u32WaitTimes))
        {
        }
        if (0U == u32WaitTimes)
        {
            return kStatus_QSCI_Timeout;
        }
#else
        /* wait last byte to shift out at TxD */
        while (0U == (base->STAT & QSCI_STAT_TIDLE_MASK))
        {
        }
#endif
    }
    /* Hold QSCI in standby state during configuration */
    base->CTRL1 |= QSCI_CTRL1_RWU_MASK;
    base->CTRL1 &= ~(QSCI_CTRL1_TE_MASK | QSCI_CTRL1_RE_MASK);

    /* Configure baud rate */
    base->RATE  = u32Divider & 0xFFFFU;
    base->CTRL3 = QSCI_CTRL3_SBRH(u32Divider >> 16U);

    /* Re-enable transmitter and receiver */
    base->CTRL1 = ctrl1;
}

