nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
static void QSCI_WriteNonBlocking(QSCI_Type *base, const uint8_t *pu8Data, uint32_t u32Length)
{
    uint32_t i;

    /* The Non Blocking write data API assume user have ensured there is enough space in
    peripheral to write. */
    for (i = 0U; i < u32Length; i++)
    {
        base->DATA = pu8Data[i];
    }
}

static void QSCI_ReadNonBlocking(QSCI_Type *base, uint8_t *pu8Data, uint32_t u32Length)
{
    assert(NULL != pu8Data);

    uint32_t i;

    /* The Non Blocking read data API assume user have ensured there is enough data in
    peripheral to read. */
    for (i = 0U; i < u32Length; i++)
    {
        pu8Data[i] = base->DATA;
    }
}

static bool QSCI_TransferIsRxRingBufferFull(qsci_transfer_handle_t *psHandle)
{
    bool full = false;
    assert(NULL != psHandle);

    if (QSCI_TransferGetRxRingBufferLength(psHandle) == (psHandle->u16RxRingBufferSize - 1U))
    {
        full = true;
    }

    return full;
}

/*!
 * brief Get the QSCI instance from peripheral base address.
 *
 * param base QSCI peripheral base address.
 * return QSCI instance.
 */
uint16_t QSCI_GetInstance(QSCI_Type *base)
{
    uint16_t instance;
    uint16_t qsciArrayCount = (sizeof(s_pfQsciBases) / sizeof(s_pfQsciBases[0]));

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < qsciArrayCount; instance++)
    {
        if (s_pfQsciBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < qsciArrayCount);

    return instance;
}

void QSCI_TransferHandleIRQ(qsci_transfer_handle_t *psHandle)
{
    assert(NULL != psHandle);

    QSCI_Type *base = psHandle->base;
    uint8_t count;
    uint8_t u8TempCount;
    uint16_t status = QSCI_GetStatusFlags(base);
    uint8_t u8Tmpdata;

    /* If RX framing error */
    if (((uint16_t)kQSCI_RxFrameErrorFlag & status) != 0U)
    {
        /* read the STAT & DATA register and then write STAT to clear the flag */
        volatile uint16_t tmp = base->DATA;
        QSCI_ClearStatusFlags(base, kQSCI_RxFrameErrorFlag);

        psHandle->u8RxState          = (uint8_t)kQSCI_RxFramingError;
        psHandle->u32RxRemainingSize = 0U;
        psHandle->busStatus          = kStatus_QSCI_FramingError;
        /* Trigger callback. */
        if (psHandle->pfCallback != NULL)
        {
            psHandle->pfCallback(psHandle);
        }
    }

    /* If RX parity error */
    if (((uint16_t)kQSCI_RxParityErrorFlag & status) != 0U)
    {
        /* read the STAT & DATA register and then write STAT to clear the flag */
        volatile uint16_t tmp = base->DATA;
        QSCI_ClearStatusFlags(base, kQSCI_RxParityErrorFlag);

        psHandle->u8RxState          = (uint8_t)kQSCI_RxParityError;
        psHandle->u32RxRemainingSize = 0U;
        psHandle->busStatus          = kStatus_QSCI_ParityError;
        /* Trigger callback. */
        if (psHandle->pfCallback != NULL)
        {
            psHandle->pfCallback(psHandle);
        }
    }

    /* If RX overrun. */
    if (((uint16_t)kQSCI_RxOverrunFlag & status) != 0U)
    {
        /* read the STAT & DATA register and then write STAT to clear the flag */
        volatile uint16_t tmp = base->DATA;
        QSCI_ClearStatusFlags(base, kQSCI_RxOverrunFlag);
        psHandle->busStatus = kStatus_QSCI_RxHardwareOverrun;
        /* Trigger callback. */
        if (psHandle->pfCallback != NULL)
        {
            psHandle->pfCallback(psHandle);
        }
    }

    /* If RX Noise detected. */
    if (((uint16_t)kQSCI_RxNoiseFlag & status) != 0U)
    {
        /* read the STAT & DATA register and then write STAT to clear the flag */
        volatile uint16_t tmp = base->DATA;
        QSCI_ClearStatusFlags(base, kQSCI_RxNoiseFlag);
        psHandle->busStatus = kStatus_QSCI_NoiseError;
        /* Trigger callback. */
        if (psHandle->pfCallback != NULL)
        {
            psHandle->pfCallback(psHandle);
        }
    }

    /* If IDLE line was detected. */
    if ((((uint16_t)kQSCI_RxIdleLineFlag & status) != 0U) && ((QSCI_CTRL2_RIIE_MASK & base->CTRL2) != 0U))
    {
        /* If still some data in the FIFO, read out these data to user data buffer. */
        count = (base->CTRL2 & QSCI_CTRL2_RFCNT_MASK) >> QSCI_CTRL2_RFCNT_SHIFT;

        if (0U == count)
        {
            /* Maybe FIFO is disabled, check again */
            if ((base->STAT & QSCI_STAT_RDRF_MASK) != 0U)
            {
                count = 1U;
            }
        }

        /* If psHandle->u32RxRemainingSize is not 0, first save data to psHandle->pu8RxData. */
        while ((count != 0U) && (psHandle->u32RxRemainingSize != 0U))
        {
            u8TempCount = (uint8_t)MIN(psHandle->u32RxRemainingSize, (uint32_t)count);

            /* Using non block API to read the data from the registers. */
            QSCI_ReadNonBlocking(base, psHandle->pu8RxData, u8TempCount);
            psHandle->pu8RxData += u8TempCount;
            psHandle->u32RxRemainingSize -= u8TempCount;
            count -= u8TempCount;

            /* If all the data required for upper layer is ready, trigger callback. */
            if (0U == psHandle->u32RxRemainingSize)
            {
                psHandle->u8RxState = (uint8_t)kQSCI_RxIdle;

                /* Disable RX received full and error interrupt */
                QSCI_DisableInterrupts(base,
                                       (uint32_t)kQSCI_RxFullInterruptEnable | (uint32_t)kQSCI_RxErrorInterruptEnable);
                psHandle->busStatus = kStatus_QSCI_RxIdle;
                if (psHandle->pfCallback != NULL)
                {
                    psHandle->pfCallback(psHandle);
                }
            }
        }

        /* To clear IDLE flag, read QSCI status STAT with IDLE set and then read DATA.*/
        while ((QSCI_STAT_RIDLE_MASK & base->STAT) != 0U)
        {
            (void)base->DATA;
        }

        /* If u32RxRemainingSize is 0, disable idle line interrupt.*/
        if (0U == (psHandle->u32RxRemainingSize))
        {
            QSCI_DisableInterrupts(base, (uint32_t)kQSCI_RxIdleLineInterruptEnable);
        }

        psHandle->busStatus = kStatus_QSCI_IdleLineDetected;
        /* If callback is not NULL and u32RxRemainingSize is not 0. */
        if ((psHandle->pfCallback != NULL) && (psHandle->u32RxRemainingSize != 0U))
        {
            psHandle->pfCallback(psHandle);
        }
    }
    /* Receive data register full */
    if ((((uint16_t)kQSCI_RxDataRegFullFlag & status) != 0U) && ((QSCI_CTRL1_RFIE_MASK & base->CTRL1) != 0U))
    {
        count = (base->CTRL2 & QSCI_CTRL2_RFCNT_MASK) >> QSCI_CTRL2_RFCNT_SHIFT;

