nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.c
        if (0U == count)
        {
            /* Maybe FIFO is disabled, check again */
            if ((base->STAT & QSCI_STAT_RDRF_MASK) != 0U)
            {
                count = 1U;
            }
        }

        /* If psHandle->u32RxRemainingSize is not 0, first save data to psHandle->pu8RxData. */
        while ((count != 0U) && (psHandle->u32RxRemainingSize != 0U))
        {
            u8TempCount = (uint8_t)MIN(psHandle->u32RxRemainingSize, (uint32_t)count);

            /* Using non block API to read the data from the registers. */
            QSCI_ReadNonBlocking(base, psHandle->pu8RxData, u8TempCount);
            psHandle->pu8RxData += u8TempCount;
            psHandle->u32RxRemainingSize -= u8TempCount;
            count -= u8TempCount;

            /* If all the data required for upper layer is ready, trigger callback. */
            if (0U == psHandle->u32RxRemainingSize)
            {
                psHandle->u8RxState = (uint8_t)kQSCI_RxIdle;
                psHandle->busStatus = kStatus_QSCI_RxIdle;

                if (psHandle->pfCallback != NULL)
                {
                    psHandle->pfCallback(psHandle);
                }
            }
        }

        /* If use RX ring buffer, receive data to ring buffer. */
        if (psHandle->pu8RxRingBuffer != NULL)
        {
            while (0U != count--)
            {
                /* If RX ring buffer is full, trigger callback to notify over run. */
                if (QSCI_TransferIsRxRingBufferFull(psHandle))
                {
                    psHandle->busStatus = kStatus_QSCI_RxRingBufferOverrun;
                    if (psHandle->pfCallback != NULL)
                    {
                        psHandle->pfCallback(psHandle);
                    }
                }

                /* If ring buffer is still full after callback function, the oldest data is overridden. */
                if (QSCI_TransferIsRxRingBufferFull(psHandle))
                {
                    /* Increase psHandle->u16RxRingBufferTail to make room for new data. */
                    if ((uint32_t)psHandle->u16RxRingBufferTail + 1U == psHandle->u16RxRingBufferSize)
                    {
                        psHandle->u16RxRingBufferTail = 0U;
                    }
                    else
                    {
                        psHandle->u16RxRingBufferTail++;
                    }
                }

                /* Read data. */
                u8Tmpdata                                                = base->DATA;
                psHandle->pu8RxRingBuffer[psHandle->u16RxRingBufferHead] = u8Tmpdata;

                /* Increase psHandle->u16RxRingBufferHead. */
                if ((uint32_t)psHandle->u16RxRingBufferHead + 1U == psHandle->u16RxRingBufferSize)
                {
                    psHandle->u16RxRingBufferHead = 0U;
                }
                else
                {
                    psHandle->u16RxRingBufferHead++;
                }
            }
        }
        else if (0U == psHandle->u32RxRemainingSize)
        {
            /* Disable RX received full and error interrupt */
            QSCI_DisableInterrupts(base,
                                   (uint32_t)kQSCI_RxFullInterruptEnable | (uint32_t)kQSCI_RxErrorInterruptEnable);
        }
        else
        {
        }
    }

    /* If framing error or parity error happened, stop the RX interrupt when use no ring buffer */
    if (((psHandle->u8RxState == (uint8_t)kQSCI_RxFramingError) ||
         (psHandle->u8RxState == (uint8_t)kQSCI_RxParityError)) &&
        (NULL == psHandle->pu8RxRingBuffer))
    {
        QSCI_DisableInterrupts(base, (uint32_t)kQSCI_RxFullInterruptEnable | (uint32_t)kQSCI_RxErrorInterruptEnable);
    }

    /* Send data register empty and the interrupt is enabled. */
    if ((((uint16_t)kQSCI_TxDataRegEmptyFlag & status) != 0U) && ((base->CTRL1 & QSCI_CTRL1_TEIE_MASK) != 0U))
    {
        /* Get the bytes that available at this moment. */
        if (base->CTRL2 & QSCI_CTRL2_FIFO_EN_MASK)
        {
            count = (base->CTRL2 & QSCI_CTRL2_TFCNT_MASK) >> QSCI_CTRL2_TFCNT_SHIFT;
            count = (uint8_t)FSL_FEATURE_QSCI_FIFO_SIZEn(base) - count;
        }
        else
        {
            count = 1U;
        }

        while ((count != 0U) && (psHandle->u32TxRemainingSize != 0U))
        {
            u8TempCount = (uint8_t)MIN(psHandle->u32TxRemainingSize, (uint32_t)count);

            /* Using non block API to write the data to the registers. */
            QSCI_WriteNonBlocking(base, psHandle->pu8TxData, u8TempCount);
            psHandle->pu8TxData += u8TempCount;
            psHandle->u32TxRemainingSize -= u8TempCount;
            count -= u8TempCount;

            /* If all the data are written to data register, TX finished. */
            if (0U == psHandle->u32TxRemainingSize)
            {
                psHandle->u8TxState = (uint8_t)kQSCI_TxIdle;
                QSCI_DisableInterrupts(base, (uint32_t)kQSCI_TxEmptyInterruptEnable);
                QSCI_EnableInterrupts(base, (uint32_t)kQSCI_TxIdleInterruptEnable);
            }
        }
    }

    /* Transmission complete and the interrupt is enabled. */
    if ((0U != ((uint16_t)kQSCI_TxIdleFlag & status)) && (0U != (base->CTRL1 & QSCI_CTRL1_TIIE_MASK)) &&
        (psHandle->u8TxState == (uint8_t)kQSCI_TxIdle))
    {
        /* Disable transmission complete interrupt. */
        QSCI_DisableInterrupts(base, (uint32_t)kQSCI_TxIdleInterruptEnable);
        psHandle->busStatus = kStatus_QSCI_TxIdle;
        /* Trigger callback. */
        if (psHandle->pfCallback != NULL)
        {
            psHandle->pfCallback(psHandle);
        }
    }
}

#if defined(QSCI0)
void QSCI0_RERR_DriverIRQHandler(void);
void QSCI0_RCV_DriverIRQHandler(void);
void QSCI0_TRIDLE_DriverIRQHandler(void);
void QSCI0_TDRE_DriverIRQHandler(void);
void QSCI0_RERR_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[0]);
}
void QSCI0_RCV_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[0]);
}
void QSCI0_TRIDLE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[0]);
}
void QSCI0_TDRE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[0]);
}
#endif /*defined(QSCI0)*/

#if defined(QSCI1)
void QSCI1_RERR_DriverIRQHandler(void);
void QSCI1_RCV_DriverIRQHandler(void);
void QSCI1_TRIDLE_DriverIRQHandler(void);
void QSCI1_TDRE_DriverIRQHandler(void);
void QSCI1_RERR_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[1]);
}
void QSCI1_RCV_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[1]);
}
void QSCI1_TRIDLE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[1]);
}
void QSCI1_TDRE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[1]);
}
#endif /*defined(QSCI1)*/

#if defined(QSCI2)
void QSCI2_RERR_DriverIRQHandler(void);
void QSCI2_RCV_DriverIRQHandler(void);
void QSCI2_TRIDLE_DriverIRQHandler(void);
void QSCI2_TDRE_DriverIRQHandler(void);
void QSCI2_RERR_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[2]);
}
void QSCI2_RCV_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[2]);
}
void QSCI2_TRIDLE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[2]);
}
void QSCI2_TDRE_DriverIRQHandler(void)
{
    s_pfQsciIsr(s_psQsciHandles[2]);
}
#endif /*defined(QSCI2)*/
